constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        // physicalType    patch;
        nFaces          12208;
        startFace       12046;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          78;
        startFace       24254;
    }
    cylinderWalls
    {
        type            patch;
        physicalType    patch;
        nFaces          112;
        startFace       24332;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          78;
        startFace       24444;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          28;
        startFace       24522;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          28;
        startFace       24550;
    }
)

// ************************************************************************* //
