system/sampling/pointCloud.xy
-1.995 	-5.995 	0.505 
-1.995 	-5.495 	0.505 
-1.995 	-4.995 	0.505 
-1.995 	-4.495 	0.505 
-1.995 	-3.995 	0.505 
-1.995 	-3.495 	0.505 
-1.995 	-2.995 	0.505 
-1.995 	-2.495 	0.505 
-1.995 	-1.995 	0.505 
-1.995 	-1.495 	0.505 
-1.995 	-0.995 	0.505 
-1.995 	-0.495 	0.505 
-1.995 	0.005 	0.505 
-1.995 	0.505 	0.505 
-1.995 	1.005 	0.505 
-1.995 	1.505 	0.505 
-1.995 	2.005 	0.505 
-1.995 	2.505 	0.505 
-1.995 	3.005 	0.505 
-1.995 	3.505 	0.505 
-1.995 	4.005 	0.505 
-1.995 	4.505 	0.505 
-1.995 	5.005 	0.505 
-1.995 	5.505 	0.505 
-1.995 	6.005 	0.505 
-1.495 	-5.995 	0.505 
-1.495 	-5.495 	0.505 
-1.495 	-4.995 	0.505 
-1.495 	-4.495 	0.505 
-1.495 	-3.995 	0.505 
-1.495 	-3.495 	0.505 
-1.495 	-2.995 	0.505 
-1.495 	-2.495 	0.505 
-1.495 	-1.995 	0.505 
-1.495 	-1.495 	0.505 
-1.495 	-0.995 	0.505 
-1.495 	-0.495 	0.505 
-1.495 	0.005 	0.505 
-1.495 	0.505 	0.505 
-1.495 	1.005 	0.505 
-1.495 	1.505 	0.505 
-1.495 	2.005 	0.505 
-1.495 	2.505 	0.505 
-1.495 	3.005 	0.505 
-1.495 	3.505 	0.505 
-1.495 	4.005 	0.505 
-1.495 	4.505 	0.505 
-1.495 	5.005 	0.505 
-1.495 	5.505 	0.505 
-1.495 	6.005 	0.505 
-0.995 	-5.995 	0.505 
-0.995 	-5.495 	0.505 
-0.995 	-4.995 	0.505 
-0.995 	-4.495 	0.505 
-0.995 	-3.995 	0.505 
-0.995 	-3.495 	0.505 
-0.995 	-2.995 	0.505 
-0.995 	-2.495 	0.505 
-0.995 	-1.995 	0.505 
-0.995 	-1.495 	0.505 
-0.995 	-0.995 	0.505 
-0.995 	-0.495 	0.505 
-0.995 	0.005 	0.505 
-0.995 	0.505 	0.505 
-0.995 	1.005 	0.505 
-0.995 	1.505 	0.505 
-0.995 	2.005 	0.505 
-0.995 	2.505 	0.505 
-0.995 	3.005 	0.505 
-0.995 	3.505 	0.505 
-0.995 	4.005 	0.505 
-0.995 	4.505 	0.505 
-0.995 	5.005 	0.505 
-0.995 	5.505 	0.505 
-0.995 	6.005 	0.505 
-0.495 	-5.995 	0.505 
-0.495 	-5.495 	0.505 
-0.495 	-4.995 	0.505 
-0.495 	-4.495 	0.505 
-0.495 	-3.995 	0.505 
-0.495 	-3.495 	0.505 
-0.495 	-2.995 	0.505 
-0.495 	-2.495 	0.505 
-0.495 	-1.995 	0.505 
-0.495 	-1.495 	0.505 
-0.495 	-0.995 	0.505 
-0.495 	-0.495 	0.505 
-0.495 	0.505 	0.505 
-0.495 	1.005 	0.505 
-0.495 	1.505 	0.505 
-0.495 	2.005 	0.505 
-0.495 	2.505 	0.505 
-0.495 	3.005 	0.505 
-0.495 	3.505 	0.505 
-0.495 	4.005 	0.505 
-0.495 	4.505 	0.505 
-0.495 	5.005 	0.505 
-0.495 	5.505 	0.505 
-0.495 	6.005 	0.505 
0.005 	-5.995 	0.505 
...
20.005 	6.005 	0.505 
